Revit 2016 API
UIDocument Class
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public class UIDocument : IDisposable
Visual Basic
Public Class UIDocument _
	Implements IDisposable
Visual C++
public ref class UIDocument : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIDocument
 Autodesk.Revit.UI.Macros.DocumentEntryPoint
See Also
UIDocument Members
Autodesk.Revit.UI Namespace